// tarotData.js


import moonImg from '../assets/moon.png';
import lefty from '../assets/lefty.png';
import thefool from '../assets/thefool.jpg';
import theworld from '../assets/theworld.jpg';
import emperor from '../assets/emperor.jpg';
import chariot from '../assets/chariot.jpg';
import tower from '../assets/tower.jpg';
import twoofcup from '../assets/twoofcup.jpg';
import backimg from '../assets/tarotback.png';

const tarotCards = [
  {
        id: '0',
        name: 'The Fool',
        meaning: 'စတင်မှုအသစ်များ၊ မသိသေးသောအရာများအပေါ် ယုံကြည်မှု။',
        img: thefool,
        back: backimg,
        role: {
            အတိတ်: 'အတိတ်ကာလတွင် သင်သည် စတင်မှုအသစ်များအပေါ် ယုံကြည်ခဲ့သည်။',
            ပစ္စုပ္ပန်: 'လက်ရှိတွင် သင်သည် အလွတ်သဘောနှင့် စိတ်ဝင်စားမှုများဖြင့် ရှေ့ဆက်နေသည်။',
            အနာဂတ်: 'အနာဂတ်တွင် သင်သည် ခရီးသစ်များစွာ စတင်လျက် ရှိမည်ဖြစ်သည်။'
        }
    },
    {
        id: '1',
        name: 'The Magician',
        meaning: 'စွမ်းအားအသုံးချခြင်း၊ ဖန်တီးမှုစွမ်းရည်။',
        img: theworld,
        back :backimg,
        role: {
            အတိတ်: 'အတိတ်ကာလတွင် သင်သည် ကိုယ်ပိုင်စွမ်းရည်များဖြင့် မျှော်လင့်ချက်များအတွက် ကြိုးပမ်းခဲ့သည်။',
            ပစ္စုပ္ပန်: 'လက်ရှိတွင် သင်သည် သင်၏စွမ်းရည်ကို အသုံးချနိုင်စွမ်းရှိသည်။',
            အနာဂတ်: 'အနာဂတ်တွင် သင်၏ အတွေးအမြင်များကို အကောင်အထည်ဖော်နိုင်မည်။'
        }
    },
    {
        id: '2',
        name: 'The High Priestess',
        meaning: 'အတွင်းစိတ်သိမြင်မှု၊ လျှို့ဝှက်သိမြင်မှု။',
         img : emperor,
         back: backimg, 
        role: {
            အတိတ်: 'အတိတ်ကာလတွင် သင်သည် မသိမသာ လမ်းညွှန်မှုရရှိခဲ့သည်။',
            ပစ္စုပ္ပန်: 'လက်ရှိတွင် သင်၏အတွင်းစိတ်အသံကို နားထောင်နေသည်။',
            အနာဂတ်: 'အနာဂတ်တွင် လျှို့ဝှက်ချက်တစ်ခုကို သိရှိမည်။'
        }
    },
    {
        id: '3',
        name: 'The Empress',
        meaning: 'ချစ်ခြင်းမေတ္တာ၊ ဖန်တီးမှု၊ ပျိုးထောင်မှု။',
        img : chariot,
        back :backimg,
        role: {
            အတိတ်: 'အတိတ်ကာလတွင် သင်သည် ဖန်တီးမှုနှင့် အဖော်အချင်းများဖြင့် စတင်ခဲ့သည်။',
            ပစ္စုပ္ပန်: 'လက်ရှိတွင် သင်သည် သဘာဝနှင့် ပတ်သက်မှုများစွာတွင် တက်ကြွလျက်ရှိသည်။',
            အနာဂတ်: 'အနာဂတ်တွင် သင်သည် ပိုမိုအောင်မြင်သော ပျိုးထောင်မှုတစ်ခုအတွက် အခြေခံတည်ဆောက်လျက်ရှိမည်။'
        }
    },
    {
        id: '4',
        name: 'The Emperor',
        meaning: 'စည်းမျဉ်းစည်းကမ်း၊ အာဏာပိုင်။',
        img : tower,
        back: backimg,
        role: {
            အတိတ်: 'အတိတ်ကာလတွင် သင်သည် တာဝန်ယူမှုများနှင့် အုပ်ချုပ်မှုလုပ်ငန်းများတွင် ပါဝင်ခဲ့သည်။',
            ပစ္စုပ္ပန်: 'လက်ရှိတွင် သင်သည် အာဏာပိုင်တစ်ဦးအဖြစ် တည်တံ့လျက်ရှိသည်။',
            အနာဂတ်: 'အနာဂတ်တွင် သင်သည် အခြေခံအုတ်မြစ်တစ်ခုကို တည်ဆောက်နိုင်မည်ဖြစ်သည်။'
        }
    },
    {
        id: '5',
        name: 'The Hierophant',
        meaning: 'ရိုးရာလမ်းစဉ်များ၊ သင်ကြားမှု။',
        img : twoofcup,
        back : backimg,
        role: {
            အတိတ်: 'အတိတ်ကာလတွင် သင်သည် တရားတော်သင်ကြားမှုများနှင့် ရိုးရာစဉ်လာများအပေါ် သင်ယူခဲ့သည်။',
            ပစ္စုပ္ပန်: 'လက်ရှိတွင် သင်သည် စည်းမျဉ်းစည်းကမ်းများအပေါ် တန်ဖိုးထား၍ လေ့လာလျက်ရှိသည်။',
            အနာဂတ်: 'အနာဂတ်တွင် သင်သည် သူများကို ဗဟုသုတပေးနိုင်သော ဗဟုသုတအရာတစ်ခုကို သင်ကြားပေးနိုင်မည်ဖြစ်သည်။'
        }
    },
   
];

export default tarotCards;
